# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 24  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C3TR, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2
  - [-1, 1, SPP,[128, [5, 9 , 12]]]
  - [-1, 3, C2f, [128]]  # 19 (P2/8-small)
  - [-1, 1, CBAM, [128]] # 20

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15, 4], 1, Concat, [1]]  # cat head P4
  - [-1, 1, SPP, [256, [5, 9 ,12]]]
  - [-1, 3, C2f, [512]]  # (P4/16-medium)
  - [-1, 1, CBAM, [256]] # 25

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12, 6], 1, Concat, [1]]  # cat head P4
  - [-1, 1, SPP, [256, [3, 7 ,9]]]
  - [-1, 3, C2f, [512]]  #  (P4/16-medium)
  - [-1, 1, CBAM, [512]] # 30

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 1, SPP, [256, [3, 5 ,7]]]
  - [-1, 3, C3TR, [1024]]  # 21 (P5/32-large)
  - [-1, 1, CBAM, [1024]] # 35

  - [[20, 25, 30, 35], 1, Detect, [nc]]  # Detect(P3, P4, P5)
